In [1]:
import pandas as pd

### pandas.concat(objs, axis=0, join='outer', ignore_index=False, keys=None, levels=None, names=None, verify_integrity=False, sort=False, copy=True)[source]Â¶
Concatenate pandas objects along a particular axis with optional set logic along the other axes.

Can also add a layer of hierarchical indexing on the concatenation axis, which may be useful if the labels are the same (or overlapping) on the passed axis number.

In [2]:
sr1=pd.Series([1,2,3,4,5])
sr1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
sr2=pd.Series([1,2,3,4,5])
sr2

0    1
1    2
2    3
3    4
4    5
dtype: int64

#### pd.concat(
    objs: 'Iterable[NDFrame] | Mapping[Hashable, NDFrame]',
    axis=0,
    join='outer',
    ignore_index: 'bool' = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool' = True,
)

In [4]:
pd.concat([sr1,sr2])

0    1
1    2
2    3
3    4
4    5
0    1
1    2
2    3
3    4
4    5
dtype: int64

#### concating 2 unequal series

In [5]:
sr1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
sr2=pd.Series([23,56,2,56,78,78,23,87,80,23])
sr2

0    23
1    56
2     2
3    56
4    78
5    78
6    23
7    87
8    80
9    23
dtype: int64

In [7]:
pd.concat([sr1,sr2])

0     1
1     2
2     3
3     4
4     5
0    23
1    56
2     2
3    56
4    78
5    78
6    23
7    87
8    80
9    23
dtype: int64

####  concating data frame

In [8]:
df1=pd.DataFrame({'id':[1,2,3,4],'name':['a','b','c','d'],'class':[6,7,8,9]})
df1

   id name  class
0   1    a      6
1   2    b      7
2   3    c      8
3   4    d      9

In [9]:
df2=pd.DataFrame({'id':[1,2,3,4],'name':['e','f','g','h'],'class':[10,11,12,13]})
df2

   id name  class
0   1    e     10
1   2    f     11
2   3    g     12
3   4    h     13

In [10]:
pd.concat([df1,df2])

   id name  class
0   1    a      6
1   2    b      7
2   3    c      8
3   4    d      9
0   1    e     10
1   2    f     11
2   3    g     12
3   4    h     13

In [11]:
pd.concat([df2,df1])

   id name  class
0   1    e     10
1   2    f     11
2   3    g     12
3   4    h     13
0   1    a      6
1   2    b      7
2   3    c      8
3   4    d      9

#### concating column wise axis=1

In [12]:
pd.concat([df1,df2],axis=1)

   id name  class  id name  class
0   1    a      6   1    e     10
1   2    b      7   2    f     11
2   3    c      8   3    g     12
3   4    d      9   4    h     13

In [13]:
pd.concat([df2,df1],axis=1)

   id name  class  id name  class
0   1    e     10   1    a      6
1   2    f     11   2    b      7
2   3    g     12   3    c      8
3   4    h     13   4    d      9

##### axis=0 is default , there index will be not in proper manner so we will use ignore_index=True

In [14]:
pd.concat([df1,df2])

   id name  class
0   1    a      6
1   2    b      7
2   3    c      8
3   4    d      9
0   1    e     10
1   2    f     11
2   3    g     12
3   4    h     13

##### using ignore_index=True

In [15]:
pd.concat([df1,df2],ignore_index=True)

   id name  class
0   1    a      6
1   2    b      7
2   3    c      8
3   4    d      9
4   1    e     10
5   2    f     11
6   3    g     12
7   4    h     13